<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>Chapter&nbsp;1.&nbsp;&#20171;&#32461;</title><link rel="stylesheet" href="html.css" tppabs="http://www.family168.com/tutorial/springsecurity/html/css/html.css" type="text/css"><meta name="generator" content="DocBook XSL Stylesheets V1.72.0"><link rel="start" href="springsecurity.html" title="Spring Security"><link rel="up" href="getting-started.html" title="Part&nbsp;I.&nbsp;&#20837;&#38376;"><link rel="prev" href="getting-started.html" title="Part&nbsp;I.&nbsp;&#20837;&#38376;"><link rel="next" href="ns-config.html" title="Chapter&nbsp;2.&nbsp;Security&#21629;&#21517;&#31354;&#38388;&#37197;&#32622;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div xmlns:fo="http://www.w3.org/1999/XSL/Format" style="background-color:white;border:none;height:73px;border:1px solid black;"><a style="border:none;" href="javascript:if(confirm('http://static.springframework.org/spring-ws/site/  \n\n该文件无法用 Teleport Ultra 下载, 因为 它是一个域或路径外部被设置为它的启始地址的地址。  \n\n你想在服务器上打开它?'))window.location='http://static.springframework.org/spring-ws/site/'" tppabs="http://static.springframework.org/spring-ws/site/" title="The Spring Framework - Spring Web Services"><img style="border:none;" src="xdev-spring_logo.jpg" tppabs="http://www.family168.com/tutorial/springsecurity/html/images/xdev-spring_logo.jpg"></a><a style="border:none;" href="javascript:if(confirm('http://www.springsource.com/  \n\n该文件无法用 Teleport Ultra 下载, 因为 它是一个域或路径外部被设置为它的启始地址的地址。  \n\n你想在服务器上打开它?'))window.location='http://www.springsource.com/'" tppabs="http://www.springsource.com/" title="SpringSource"><img style="border:none;position:absolute;padding-top:5px;right:42px;" src="s2-banner-rhs.png" tppabs="http://www.family168.com/tutorial/springsecurity/html/images/s2-banner-rhs.png"></a></div><div class="chapter" lang="en"><div class="titlepage"><div><div><h2 class="title"><a name="introduction"></a>Chapter&nbsp;1.&nbsp;&#20171;&#32461;</h2></div></div></div>



<div class="sect1" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="what-is-acegi-security"></a>1.1.&nbsp;Spring Security&#26159;&#20160;&#20040;&#65311;</h2></div></div></div>
    

    <p>Spring Security&#20026;&#22522;&#20110;J2EE&#20225;&#19994;&#24212;&#29992;&#36719;&#20214;&#25552;&#20379;&#20102;&#20840;&#38754;&#23433;&#20840;&#26381;&#21153;&#12290;
    &#29305;&#21035;&#26159;&#20351;&#29992;&#39046;&#20808;&#30340;J2EE&#35299;&#20915;&#26041;&#26696;-spring&#26694;&#26550;&#24320;&#21457;&#30340;&#20225;&#19994;&#36719;&#20214;&#39033;&#30446;&#12290;
    &#22914;&#26524;&#20320;&#27809;&#26377;&#20351;&#29992;Spring&#24320;&#21457;&#20225;&#19994;&#36719;&#20214;&#65292;&#25105;&#20204;&#28909;&#24773;&#30340;&#25512;&#33616;&#20320;&#20180;&#32454;&#30740;&#31350;&#19968;&#19979;&#12290;
    &#29087;&#24713;Spring-&#23588;&#20854;&#26159;&#20381;&#36182;&#27880;&#20837;&#21407;&#29702;-&#23558;&#24110;&#21161;&#20320;&#26356;&#24555;&#30340;&#25484;&#25569;Spring Security&#12290;</p>

    <p>&#20154;&#20204;&#20351;&#29992;Spring Security&#26377;&#24456;&#22810;&#31181;&#21407;&#22240;&#65292;&#19981;&#36807;&#36890;&#24120;&#21560;&#24341;&#20182;&#20204;&#30340;&#26159;&#22312;J2EE Servlet&#35268;&#33539;&#25110;EJB&#35268;&#33539;&#20013;&#25214;&#19981;&#21040;&#20856;&#22411;&#20225;&#19994;&#24212;&#29992;&#22330;&#26223;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;&#25552;&#21040;&#36825;&#20123;&#35268;&#33539;&#65292;&#29305;&#21035;&#35201;&#25351;&#20986;&#30340;&#26159;&#23427;&#20204;&#19981;&#33021;&#22312;WAR&#25110;EAR&#32423;&#21035;&#36827;&#34892;&#31227;&#26893;&#12290;&#36825;&#26679;&#65292;&#22914;&#26524;&#20320;&#26356;&#25442;&#26381;&#21153;&#22120;&#29615;&#22659;&#65292;&#23601;&#35201;&#65292;&#22312;&#26032;&#30340;&#30446;&#26631;&#29615;&#22659;&#36827;&#34892;&#22823;&#37327;&#30340;&#24037;&#20316;&#65292;&#23545;&#20320;&#30340;&#24212;&#29992;&#31995;&#32479;&#36827;&#34892;&#37325;&#26032;&#37197;&#32622;&#23433;&#20840;&#12290;&#20351;&#29992;Spring Security&#35299;&#20915;&#20102;&#36825;&#20123;&#38382;&#39064;&#65292;&#20063;&#20026;&#20320;&#25552;&#20379;&#20102;&#24456;&#22810;&#26377;&#29992;&#30340;&#65292;&#23436;&#20840;&#21487;&#23450;&#21046;&#30340;&#20854;&#20182;&#23433;&#20840;&#29305;&#24615;&#12290;</p>

    <p>&#20320;&#21487;&#33021;&#30693;&#36947;&#65292;&#23433;&#20840;&#21253;&#25324;&#20004;&#20010;&#20027;&#35201;&#25805;&#20316;&#12290;
    &#31532;&#19968;&#20010;&#34987;&#31216;&#20026;&#8220;&#35748;&#35777;&#8221;&#65292;&#26159;&#20026;&#29992;&#25143;&#24314;&#31435;&#19968;&#20010;&#20182;&#25152;&#22768;&#26126;&#30340;&#20027;&#20307;&#12290;
    &#20027;&#20307;&#19968;&#33324;&#26159;&#25351;&#29992;&#25143;&#65292;&#35774;&#22791;&#25110;&#21487;&#20197;&#22312;&#20320;&#31995;&#32479;&#20013;&#25191;&#34892;&#34892;&#21160;&#30340;&#20854;&#20182;&#31995;&#32479;&#12290;
    &#8220;&#25480;&#26435;&#8221;&#25351;&#30340;&#19968;&#20010;&#29992;&#25143;&#33021;&#21542;&#22312;&#20320;&#30340;&#24212;&#29992;&#20013;&#25191;&#34892;&#26576;&#20010;&#25805;&#20316;&#12290;
    &#22312;&#21040;&#36798;&#25480;&#26435;&#21028;&#26029;&#20043;&#21069;&#65292;&#36523;&#20221;&#30340;&#20027;&#20307;&#24050;&#32463;&#30001;&#36523;&#20221;&#39564;&#35777;&#36807;&#31243;&#24314;&#31435;&#20102;&#12290;
    &#36825;&#20123;&#27010;&#24565;&#26159;&#36890;&#29992;&#30340;&#65292;&#19981;&#26159;Spring Security&#29305;&#26377;&#30340;&#12290;</p>

    <p>&#22312;&#36523;&#20221;&#39564;&#35777;&#23618;&#38754;&#65292;Spring Security&#24191;&#27867;&#25903;&#25345;&#21508;&#31181;&#36523;&#20221;&#39564;&#35777;&#27169;&#24335;&#12290;
    &#36825;&#20123;&#39564;&#35777;&#27169;&#22411;&#32477;&#22823;&#22810;&#25968;&#37117;&#30001;&#31532;&#19977;&#26041;&#25552;&#20379;&#65292;&#25110;&#27491;&#22312;&#24320;&#21457;&#30340;&#26377;&#20851;&#26631;&#20934;&#26426;&#26500;&#25552;&#20379;&#30340;&#65292;&#20363;&#22914;Internet Engineering Task Force&#12290;
    &#20316;&#20026;&#34917;&#20805;&#65292;Spring Security&#20063;&#25552;&#20379;&#20102;&#33258;&#24049;&#30340;&#19968;&#22871;&#39564;&#35777;&#21151;&#33021;&#12290;
    Spring Security&#30446;&#21069;&#25903;&#25345;&#35748;&#35777;&#19968;&#20307;&#21270;&#21644;&#22914;&#19979;&#35748;&#35777;&#25216;&#26415;&#65306;</p>

    <div class="itemizedlist"><ul type="disc" compact><li>
            <p>HTTP BASIC authentication headers (&#19968;&#20010;&#22522;&#20110;IEFT RFC&#30340;&#26631;&#20934;)</p>
        </li><li>
            <p>HTTP Digest authentication headers (&#19968;&#20010;&#22522;&#20110;IEFT RFC&#30340;&#26631;&#20934;)</p>
        </li><li>
            <p>HTTP X.509 client certificate exchange (&#19968;&#20010;&#22522;&#20110;IEFT RFC&#30340;&#26631;&#20934;)</p>
        </li><li>
            <p>LDAP (&#19968;&#20010;&#38750;&#24120;&#24120;&#35265;&#30340;&#36328;&#24179;&#21488;&#35748;&#35777;&#38656;&#35201;&#20570;&#27861;&#65292;&#29305;&#21035;&#26159;&#22312;&#22823;&#29615;&#22659;)</p>
        </li><li>
            <p>Form-based authentication (&#25552;&#20379;&#31616;&#21333;&#29992;&#25143;&#25509;&#21475;&#30340;&#38656;&#27714;)</p>
        </li><li>
            <p>OpenID authentication</p>
        </li><li>
            <p>Computer Associates Siteminder</p>
        </li><li>
            <p>JA-SIG Central Authentication Service (&#20063;&#34987;&#31216;&#20026;CAS&#65292;&#36825;&#26159;&#19968;&#20010;&#27969;&#34892;&#30340;&#24320;&#28304;&#21333;&#28857;&#30331;&#24405;&#31995;&#32479;)</p>
        </li><li>
            <p>Transparent authentication context propagation for Remote
                Method Invocation (RMI) and HttpInvoker (&#19968;&#20010;Spring&#36828;&#31243;&#35843;&#29992;&#21327;&#35758;)</p>
        </li><li>
            <p>Automatic "remember-me" authentication (&#36825;&#26679;&#20320;&#21487;&#20197;&#35774;&#32622;&#19968;&#27573;&#26102;&#38388;&#65292;&#36991;&#20813;&#22312;&#19968;&#27573;&#26102;&#38388;&#20869;&#36824;&#38656;&#35201;&#37325;&#26032;&#39564;&#35777;)</p>
        </li><li>
            <p>Anonymous authentication (&#20801;&#35768;&#20219;&#20309;&#35843;&#29992;&#65292;&#33258;&#21160;&#20551;&#35774;&#19968;&#20010;&#29305;&#23450;&#30340;&#23433;&#20840;&#20027;&#20307;)</p>
        </li><li>
            <p>Run-as authentication (&#36825;&#22312;&#19968;&#20010;&#20250;&#35805;&#20869;&#20351;&#29992;&#19981;&#21516;&#23433;&#20840;&#36523;&#20221;&#30340;&#26102;&#20505;&#26159;&#38750;&#24120;&#26377;&#29992;&#30340;)</p>
        </li><li>
            <p>Java Authentication and Authorization Service (JAAS)</p>
        </li><li>
            <p>Container integration with JBoss, Jetty, Resin and Tomcat
                (&#36825;&#26679;&#65292;&#20320;&#21487;&#20197;&#32487;&#32493;&#20351;&#29992;&#23481;&#22120;&#31649;&#29702;&#35748;&#35777;&#65292;&#22914;&#26524;&#24819;&#30340;&#35805;)</p>
        </li><li>
            <p>Java Open Source Single Sign On (JOSSO) *</p>
        </li><li>
            <p>OpenNMS Network Management Platform *</p>
        </li><li>
            <p>AppFuse *</p>
        </li><li>
            <p>AndroMDA *</p>
        </li><li>
            <p>Mule ESB *</p>
        </li><li>
            <p>Direct Web Request (DWR) *</p>
        </li><li>
            <p>Grails *</p>
        </li><li>
            <p>Tapestry *</p>
        </li><li>
            <p>JTrac *</p>
        </li><li>
            <p>Jasypt *</p>
        </li><li>
            <p>Roller *</p>
        </li><li>
            <p>Elastic Plath *</p>
        </li><li>
            <p>Atlassian Crowd *</p>
        </li><li>
            <p>&#20320;&#33258;&#24049;&#30340;&#35748;&#35777;&#31995;&#32479;(&#21521;&#19979;&#30475;)</p>
        </li></ul></div>

    <p>(* &#26159;&#25351;&#30001;&#31532;&#19977;&#26041;&#25552;&#20379;&#65292;&#26597;&#30475;&#25105;&#20204;&#30340;<a xmlns:xlink="http://www.w3.org/1999/xlink" href="javascript:if(confirm('http://acegisecurity.org/powering.html  \n\n该文件无法用 Teleport Ultra 下载, 因为 它是一个域或路径外部被设置为它的启始地址的地址。  \n\n你想在服务器上打开它?'))window.location='http://acegisecurity.org/powering.html'" tppabs="http://acegisecurity.org/powering.html" target="_top">&#25972;&#21512;&#32593;&#39029;</a>&#65292;&#33719;&#24471;&#26368;&#26032;&#35814;&#24773;&#30340;&#38142;&#25509;&#12290;)</p>

    <p>&#35768;&#22810;&#29420;&#31435;&#36719;&#20214;&#20379;&#24212;&#21830;&#65288;ISVs, independent software vendors&#65289;&#37319;&#29992;Spring Security&#65292;&#26159;&#22240;&#20026;&#23427;&#25317;&#26377;&#20016;&#23500;&#28789;&#27963;&#30340;&#39564;&#35777;&#27169;&#22411;&#12290;
    &#36825;&#26679;&#65292;&#26080;&#35770;&#32456;&#31471;&#29992;&#25143;&#38656;&#35201;&#20160;&#20040;&#65292;&#20182;&#20204;&#37117;&#21487;&#20197;&#24555;&#36895;&#38598;&#25104;&#21040;&#31995;&#32479;&#20013;&#65292;&#19981;&#29992;&#33457;&#24456;&#22810;&#21151;&#22827;&#65292;&#20063;&#19981;&#29992;&#35753;&#29992;&#25143;&#25913;&#21464;&#36816;&#34892;&#29615;&#22659;&#12290;
    &#22914;&#26524;&#19978;&#36848;&#30340;&#39564;&#35777;&#26426;&#21046;&#37117;&#27809;&#26377;&#28385;&#36275;&#20320;&#30340;&#38656;&#35201;&#65292;Spring Security&#26159;&#19968;&#20010;&#24320;&#25918;&#30340;&#24179;&#21488;&#65292;&#32534;&#20889;&#33258;&#24049;&#30340;&#39564;&#35777;&#26426;&#21046;&#26159;&#21313;&#20998;&#31616;&#21333;&#30340;&#12290;
    Spring Security&#30340;&#35768;&#22810;&#20225;&#19994;&#29992;&#25143;&#38656;&#35201;&#25972;&#21512;&#19981;&#36981;&#24490;&#20219;&#20309;&#29305;&#23450;&#23433;&#20840;&#26631;&#20934;&#30340;&#8220;&#36951;&#30041;&#8221;&#31995;&#32479;&#65292;Spring Security&#22312;&#36825;&#31867;&#31995;&#32479;&#19978;&#20063;&#34920;&#29616;&#30340;&#24456;&#22909;&#12290;</p>

    <p>&#26377;&#26102;&#22522;&#26412;&#30340;&#35748;&#35777;&#26159;&#19981;&#22815;&#30340;&#12290;
    &#26377;&#26102;&#20320;&#38656;&#35201;&#26681;&#25454;&#22312;&#20027;&#20307;&#21644;&#24212;&#29992;&#20132;&#20114;&#30340;&#26041;&#24335;&#26469;&#24212;&#29992;&#19981;&#21516;&#30340;&#23433;&#20840;&#25514;&#26045;&#12290;
    &#27604;&#22914;&#65292;&#20320;&#21487;&#33021;&#65292;&#20026;&#20102;&#20445;&#25252;&#23494;&#30721;&#65292;&#19981;&#34987;&#31363;&#21548;&#25110;&#21463;&#21040;&#20013;&#38388;&#20154;&#25915;&#20987;&#65292;&#24076;&#26395;&#30830;&#20445;&#35831;&#27714;&#21482;&#36890;&#36807;HTTPS&#21040;&#36798;&#12290;
    &#25110;&#32773;&#65292;&#20320;&#24076;&#26395;&#30830;&#20445;&#21457;&#36215;&#35831;&#27714;&#30340;&#26159;&#19968;&#20010;&#30495;&#27491;&#30340;&#20154;&#65292;&#32780;&#19981;&#26159;&#26426;&#22120;&#20154;&#25110;&#20854;&#20182;&#33258;&#21160;&#21270;&#31243;&#24207;&#12290;
    &#36825;&#23545;&#20445;&#25252;&#25214;&#22238;&#23494;&#30721;&#19981;&#34987;&#26292;&#21147;&#25915;&#20987;&#29305;&#21035;&#26377;&#24110;&#21161;&#65292;&#25110;&#32773;&#35753;&#21035;&#20154;&#26356;&#38590;&#22797;&#21046;&#20320;&#31243;&#24207;&#20013;&#30340;&#20851;&#38190;&#20869;&#23481;&#12290;
    &#20026;&#20102;&#24110;&#21161;&#20320;&#23454;&#29616;&#36825;&#20123;&#30446;&#26631;&#65292;Spring Security&#25903;&#25345;&#33258;&#21160;&#8220;&#36890;&#36947;&#23433;&#20840;&#8221;&#65292;&#25972;&#21512;jcaptcha&#19968;&#20307;&#21270;&#36827;&#34892;&#20154;&#31867;&#29992;&#25143;&#26816;&#27979;&#12290;</p>

    <p>Spring Security&#19981;&#20165;&#25552;&#20379;&#35748;&#35777;&#21151;&#33021;&#65292;&#20063;&#25552;&#20379;&#20102;&#23436;&#22791;&#30340;&#25480;&#26435;&#21151;&#33021;&#12290;
    &#22312;&#25480;&#26435;&#26041;&#38754;&#20027;&#35201;&#26377;&#19977;&#20010;&#39046;&#22495;&#65292;&#25480;&#26435;web&#35831;&#27714;&#65292;&#25480;&#26435;&#34987;&#35843;&#29992;&#26041;&#27861;&#65292;&#25480;&#26435;&#35775;&#38382;&#21333;&#20010;&#23545;&#35937;&#30340;&#23454;&#20363;&#12290;
    &#20026;&#20102;&#24110;&#20320;&#20102;&#35299;&#23427;&#20204;&#20043;&#38388;&#30340;&#21306;&#21035;&#65292;&#23545;&#29031;&#32771;&#34385;&#25480;&#22312;Servlet&#35268;&#33539;web&#27169;&#24335;&#23433;&#20840;&#65292;EJB&#23481;&#22120;&#31649;&#29702;&#23433;&#20840;&#65292;&#21644;&#25991;&#20214;&#31995;&#32479;&#23433;&#20840;&#26041;&#38754;&#30340;&#25480;&#26435;&#26041;&#24335;&#12290;
    Spring Security&#22312;&#25152;&#26377;&#36825;&#20123;&#37325;&#35201;&#39046;&#22495;&#37117;&#25552;&#20379;&#20102;&#23436;&#22791;&#30340;&#33021;&#21147;&#65292;&#25105;&#20204;&#23558;&#22312;&#36825;&#20221;&#21442;&#32771;&#25351;&#21335;&#30340;&#21518;&#38754;&#36827;&#34892;&#25506;&#35752;&#12290;</p>
</div>

<div class="sect1" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="history"></a>1.2.&nbsp;&#21382;&#21490;</h2></div></div></div>
    

    <p>Spring Security&#24320;&#22987;&#20110;2003&#24180;&#24180;&#24213;&#65292;&#37027;&#26102;&#20505;&#21483;&#8220;spring&#30340;acegi&#23433;&#20840;&#31995;&#32479;&#8221;&#12290;
    &#36215;&#22240;&#26159;Spring&#24320;&#21457;&#32773;&#37038;&#20214;&#21015;&#34920;&#20013;&#30340;&#19968;&#20010;&#38382;&#39064;&#65292;&#26377;&#20154;&#25552;&#38382;&#26159;&#21542;&#32771;&#34385;&#25552;&#20379;&#19968;&#20010;&#22522;&#20110;spring&#30340;&#23433;&#20840;&#23454;&#29616;&#12290;
    &#22312;&#24403;&#26102;Spring&#30340;&#31038;&#21306;&#30456;&#23545;&#36739;&#23567;&#65288;&#23588;&#20854;&#26159;&#21644;&#20170;&#22825;&#30340;&#35268;&#27169;&#27604;&#65281;&#65289;&#65292;&#20854;&#23454;Spring&#26412;&#36523;&#26159;&#20174;2003&#24180;&#21021;&#25165;&#20316;&#20026;&#19968;&#20010;sourceforge&#30340;&#39033;&#30446;&#20986;&#29616;&#30340;&#12290;
    &#23545;&#36825;&#20010;&#38382;&#39064;&#30340;&#22238;&#24212;&#26159;&#65292;&#36825;&#30340;&#30830;&#26159;&#19968;&#20010;&#20540;&#24471;&#30740;&#31350;&#30340;&#39046;&#22495;&#65292;&#34429;&#28982;&#38480;&#20110;&#26102;&#38388;&#38382;&#39064;&#38459;&#30861;&#20102;&#23545;&#23427;&#30340;&#32487;&#32493;&#30740;&#31350;&#12290;</p>

    <p>&#26377;&#37492;&#20110;&#27492;&#65292;&#19968;&#20010;&#31616;&#21333;&#30340;&#23433;&#20840;&#23454;&#29616;&#24314;&#31435;&#36215;&#26469;&#20102;&#65292;&#20294;&#27809;&#26377;&#21457;&#24067;&#12290;
    &#20960;&#21608;&#20043;&#21518;&#65292;spring&#31038;&#21306;&#30340;&#20854;&#20182;&#25104;&#21592;&#35810;&#38382;&#23433;&#20840;&#38382;&#39064;&#65292;&#20195;&#30721;&#23601;&#34987;&#25552;&#20379;&#32473;&#20102;&#20182;&#20204;&#12290;
    &#38543;&#21518;&#21448;&#26377;&#20154;&#35831;&#27714;&#65292;&#22312;2004&#24180;&#19968;&#26376;&#24038;&#21491;&#65292;&#26377;20&#20154;&#22312;&#20351;&#29992;&#36825;&#20123;&#20195;&#30721;&#12290;
    &#21478;&#22806;&#19968;&#20123;&#20154;&#21152;&#20837;&#21040;&#36825;&#20123;&#20808;&#34892;&#32773;&#20013;&#26469;&#65292;&#24182;&#24314;&#35758;&#22312;sourceforge&#19978;&#24314;&#31435;&#19968;&#20010;&#39033;&#30446;&#65292;&#39033;&#30446;&#22312;2004&#24180;3&#26376;&#27491;&#24335;&#24314;&#31435;&#36215;&#26469;&#12290;</p>

    <p>&#22312;&#26089;&#26399;&#65292;&#39033;&#30446;&#26412;&#36523;&#27809;&#26377;&#33258;&#24049;&#30340;&#35748;&#35777;&#27169;&#22359;&#12290;
    &#35748;&#35777;&#36807;&#31243;&#37117;&#26159;&#20381;&#36182;&#23481;&#22120;&#31649;&#29702;&#23433;&#20840;&#30340;&#65292;&#32780;acegi&#21017;&#27880;&#37325;&#25480;&#26435;&#12290;
    &#36825;&#22312;&#19968;&#24320;&#22987;&#26159;&#21512;&#36866;&#30340;&#65292;&#20294;&#38543;&#30528;&#36234;&#26469;&#36234;&#22810;&#29992;&#25143;&#35201;&#27714;&#25552;&#20379;&#39069;&#22806;&#30340;&#23481;&#22120;&#25903;&#25345;&#65292;&#22522;&#20110;&#23481;&#22120;&#35748;&#35777;&#30340;&#38480;&#21046;&#23601;&#26174;&#29616;&#20986;&#26469;&#20102;&#12290;
    &#36824;&#26377;&#19968;&#20010;&#26377;&#20851;&#30340;&#38382;&#39064;&#65292;&#21521;&#23481;&#22120;&#30340;classpath&#20013;&#28155;&#21152;&#26032;jar&#65292;&#24120;&#24120;&#35753;&#26368;&#32456;&#29992;&#25143;&#24863;&#21040;&#22256;&#24785;&#65292;&#21448;&#23481;&#26131;&#20986;&#29616;&#37197;&#32622;&#38169;&#35823;&#12290;</p>

    <p>&#38543;&#21518;acegi&#21152;&#20837;&#20102;&#35748;&#35777;&#26381;&#21153;&#12290;&#22823;&#32422;&#19968;&#24180;&#21518;&#65292;acegi&#25104;&#20026;spring&#30340;&#23448;&#26041;&#23376;&#39033;&#30446;&#12290;
    &#32463;&#36807;&#20102;&#20004;&#24180;&#21322;&#22312;&#35768;&#22810;&#29983;&#20135;&#36719;&#20214;&#39033;&#30446;&#20013;&#30340;&#27963;&#36291;&#20351;&#29992;&#21644;&#25968;&#20197;&#19975;&#35745;&#30340;&#25913;&#21892;&#21644;&#31038;&#21306;&#30340;&#36129;&#29486;&#65292;1.0.0&#26368;&#32456;&#29256;&#26412;&#21457;&#24067;&#20110;2006&#24180;5&#26376;&#12290;</p>

    <p>acegi&#22312;2007&#24180;&#24180;&#24213;&#65292;&#27491;&#24335;&#25104;&#20026;spring&#32452;&#21512;&#39033;&#30446;&#65292;&#34987;&#26356;&#21517;&#20026;&#8220;Spring Security&#8221;&#12290;</p>

    <p>&#29616;&#22312;&#65292;Spring Security&#25104;&#20026;&#20102;&#19968;&#20010;&#24378;&#22823;&#32780;&#21448;&#27963;&#36291;&#30340;&#24320;&#28304;&#31038;&#21306;&#12290;
    &#22312;Spring Security&#25903;&#25345;&#35770;&#22363;&#19978;&#26377;&#25104;&#21315;&#19978;&#19975;&#30340;&#20449;&#24687;&#12290;
    &#26377;&#19968;&#20010;&#31215;&#26497;&#30340;&#26680;&#24515;&#24320;&#21457;&#22242;&#38431;&#19987;&#32844;&#24320;&#21457;&#65292;&#19968;&#20010;&#31215;&#26497;&#30340;&#31038;&#21306;&#23450;&#26399;&#20849;&#20139;&#34917;&#19969;&#24182;&#25903;&#25345;&#20182;&#20204;&#30340;&#21516;&#20276;&#12290;</p>
</div>

<div class="sect1" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="release-numbering"></a>1.3.&nbsp;&#21457;&#34892;&#29256;&#26412;&#21495;</h2></div></div></div>
    

    <p>&#20102;&#35299;spring Security&#21457;&#34892;&#29256;&#26412;&#21495;&#26159;&#38750;&#24120;&#26377;&#29992;&#30340;&#12290;&#23427;&#21487;&#20197;&#24110;&#21161;&#20320;&#21028;&#26029;&#21319;&#32423;&#21040;&#26032;&#30340;&#29256;&#26412;&#26159;&#21542;&#38656;&#35201;&#33457;&#36153;&#24456;&#22823;&#30340;&#31934;&#21147;&#12290;
    &#25105;&#20204;&#20351;&#29992;apache&#20415;&#25658;&#24335;&#36816;&#34892;&#39033;&#30446;&#29256;&#26412;&#25351;&#21335;&#65292;&#21487;&#20197;&#22312;&#20197;&#19979;&#32593;&#22336;&#26597;&#30475;<code class="literal">http://apr.apache.org/versioning.html</code>&#12290;
    &#20026;&#20102;&#26041;&#20415;&#22823;&#23478;&#65292;&#25105;&#20204;&#24341;&#29992;&#39029;&#38754;&#19978;&#30340;&#19968;&#27573;&#20171;&#32461;&#65306;</p>

    <p>&#8220;<span class="quote">&#29256;&#26412;&#21495;&#26159;&#19968;&#20010;&#21253;&#21547;&#19977;&#20010;&#25972;&#25968;&#30340;&#32452;&#21512;&#65306;&#20027;&#35201;&#29256;&#26412;&#21495;.&#27425;&#35201;&#29256;&#26412;&#21495;.&#34917;&#19969;&#12290;
    &#22522;&#26412;&#24605;&#36335;&#26159;&#20027;&#35201;&#29256;&#26412;&#26159;&#19981;&#20860;&#23481;&#30340;&#65292;&#22823;&#35268;&#27169;&#21319;&#32423;API&#12290;
    &#27425;&#35201;&#29256;&#26412;&#21495;&#22312;&#28304;&#20195;&#30721;&#21644;&#20108;&#36827;&#21046;&#35201;&#19982;&#32769;&#29256;&#26412;&#20445;&#25345;&#20860;&#23481;&#65292;&#34917;&#19969;&#21017;&#24847;&#21619;&#30528;&#21521;&#21069;&#21521;&#21518;&#30340;&#23436;&#20840;&#20860;&#23481;&#12290;</span>&#8221;</p>
</div>

<div class="sect1" lang="en"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="get-source"></a>1.4.&nbsp;&#33719;&#24471;&#28304;&#20195;&#30721;</h2></div></div></div>
    
    <p>Spring Security&#26159;&#19968;&#20010;&#24320;&#28304;&#39033;&#30446;&#65292;&#25105;&#20204;&#22823;&#21147;&#25512;&#33616;&#20320;&#20174;subversion&#33719;&#24471;&#28304;&#20195;&#30721;&#12290;
    &#36825;&#26679;&#20320;&#21487;&#20197;&#33719;&#24471;&#25152;&#26377;&#30340;&#31034;&#20363;&#65292;&#20320;&#21487;&#20197;&#24456;&#23481;&#26131;&#30340;&#24314;&#31435;&#30446;&#21069;&#26368;&#26032;&#30340;&#39033;&#30446;&#12290;
    &#33719;&#24471;&#39033;&#30446;&#30340;&#28304;&#20195;&#30721;&#23545;&#35843;&#35797;&#20063;&#26377;&#24456;&#22823;&#30340;&#24110;&#21161;&#12290;
    &#24322;&#24120;&#22534;&#26632;&#19981;&#20877;&#26159;&#27169;&#31946;&#30340;&#40657;&#30418;&#38382;&#39064;&#65292;&#20320;&#21487;&#20197;&#30452;&#25509;&#25214;&#21040;&#21457;&#29983;&#38382;&#39064;&#30340;&#37027;&#19968;&#34892;&#65292;&#26597;&#25214;&#21457;&#29983;&#20102;&#20160;&#20040;&#39069;&#22806;&#38590;&#39064;&#12290;
    &#28304;&#20195;&#30721;&#20063;&#26159;&#39033;&#30446;&#30340;&#26368;&#32456;&#25991;&#26723;&#65292;&#24120;&#24120;&#26159;&#26368;&#31616;&#21333;&#30340;&#26041;&#27861;&#65292;&#25214;&#20986;&#36825;&#20123;&#20107;&#24773;&#26159;&#22914;&#20309;&#24037;&#20316;&#30340;&#12290;
    </p>
    <p>
        &#35201;&#20687;&#33719;&#24471;&#39033;&#30446;&#26368;&#26032;&#30340;&#28304;&#20195;&#30721;&#65292;&#20351;&#29992;&#22914;&#19979;subversion&#21629;&#20196;:
</p><pre class="programlisting">
    svn checkout http://acegisecurity.svn.sourceforge.net/svnroot/acegisecurity/spring-security/trunk/
</pre><p>
        &#20320;&#21487;&#20197;&#33719;&#24471;&#29305;&#23450;&#29256;&#26412;&#30340;&#28304;&#20195;&#30721; <code class="literal">http://acegisecurity.svn.sourceforge.net/svnroot/acegisecurity/spring-security/tags/</code>.
    </p>

</div>

</div><div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="getting-started.html" tppabs="http://www.family168.com/tutorial/springsecurity/html/getting-started.html">Prev</a>&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="springsecurity.html" tppabs="http://www.family168.com/tutorial/springsecurity/html/springsecurity.html">Home</a></td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ns-config.html" tppabs="http://www.family168.com/tutorial/springsecurity/html/ns-config.html">Next</a></td></tr><tr><td width="40%" align="left" valign="top">Part&nbsp;I.&nbsp;&#20837;&#38376;&nbsp;</td><td width="20%" align="center"><span style="color:white;font-size:90%;"><a href="javascript:if(confirm('http://www.springsource.com/  \n\n该文件无法用 Teleport Ultra 下载, 因为 它是一个域或路径外部被设置为它的启始地址的地址。  \n\n你想在服务器上打开它?'))window.location='http://www.springsource.com/'" tppabs="http://www.springsource.com/" title="SpringSource">Sponsored by SpringSource
                                        </a></span></td><td width="40%" align="right" valign="top">&nbsp;Chapter&nbsp;2.&nbsp;Security&#21629;&#21517;&#31354;&#38388;&#37197;&#32622;</td></tr></table></div></body></html><script type="text/javascript">var gaJsHost = (("https:" == document.location.protocol) ? "https://ssl." : "http://www./");document.write(unescape("%3Cscript src='" + gaJsHost + "google-analytics.com/ga.js' type='text/javascript'%3E%3C/script%3E"));</script><script type="text/javascript">var pageTracker = _gat._getTracker("UA-2857097-3");pageTracker._initData();pageTracker._trackPageview();</script>