<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<title>&#24207;&#35328;</title>
<link rel="stylesheet" href="views/dataPages/html.css"
	tppabs="http://www.family168.com/tutorial/springsecurity/html/css/html.css"
	type="text/css">
<meta name="generator" content="DocBook XSL Stylesheets V1.72.0">
<link rel="start" href="views/dataPages/springsecurity.html" title="Spring Security">
<link rel="up" href="views/dataPages/springsecurity.html" title="Spring Security">
<link rel="prev" href="views/dataPages/springsecurity.html" title="Spring Security">
<link rel="next" href="views/dataPages/getting-started.html"
	title="Part&nbsp;I.&nbsp;&#20837;&#38376;">
</head>
<body bgcolor="white" text="black" link="#0000FF" vlink="#840084"
	alink="#0000FF">
	<div xmlns:fo="http://www.w3.org/1999/XSL/Format"
		style="background-color: white; border: none; height: 73px; border: 1px solid black;">
		<a style="border: none;"
			href="javascript:if(confirm('http://static.springframework.org/spring-ws/site/  \n\n该文件无法用 Teleport Ultra 下载, 因为 它是一个域或路径外部被设置为它的启始地址的地址。  \n\n你想在服务器上打开它?'))window.location='http://static.springframework.org/spring-ws/site/'"
			tppabs="http://static.springframework.org/spring-ws/site/"
			title="The Spring Framework - Spring Web Services"><img
			style="border: none;" src="views/dataPages/xdev-spring_logo.jpg"
			tppabs="http://www.family168.com/tutorial/springsecurity/html/images/xdev-spring_logo.jpg"></a><a
			style="border: none;"
			href="javascript:if(confirm('http://www.springsource.com/  \n\n该文件无法用 Teleport Ultra 下载, 因为 它是一个域或路径外部被设置为它的启始地址的地址。  \n\n你想在服务器上打开它?'))window.location='http://www.springsource.com/'"
			tppabs="http://www.springsource.com/" title="SpringSource"><img
			style="border: none; position: absolute; padding-top: 5px; right: 42px;"
			src="views/dataPages/s2-banner-rhs.png"
			tppabs="http://www.family168.com/tutorial/springsecurity/html/images/s2-banner-rhs.png"></a>
	</div>
	<div class="preface" lang="en">
		<div class="titlepage">
			<div>
				<div>
					<h2 class="title">
						<a name="preface"></a>&#24207;&#35328;
					</h2>
				</div>
			</div>
		</div>


		<p>Spring
			Security&#20026;&#22522;&#20110;J2EE&#30340;&#20225;&#19994;&#24212;&#29992;&#36719;&#20214;&#25552;&#20379;&#20102;&#19968;&#22871;&#20840;&#38754;&#30340;&#23433;&#20840;&#35299;&#20915;&#26041;&#26696;&#12290;&#27491;&#22914;&#20320;&#22312;&#26412;&#25163;&#20876;&#20013;&#30475;&#21040;&#30340;&#37027;&#26679;&#65292;&#25105;&#20204;&#23581;&#35797;&#20026;&#24744;&#25552;&#20379;&#19968;&#22871;&#22909;&#29992;&#65292;&#39640;&#21487;&#37197;&#32622;&#30340;&#23433;&#20840;&#31995;&#32479;&#12290;</p>

		<p>&#23433;&#20840;&#38382;&#39064;&#26159;&#19968;&#20010;&#19981;&#26029;&#21464;&#21270;&#30340;&#30446;&#26631;&#65292;&#26356;&#37325;&#35201;&#30340;&#26159;&#23547;&#27714;&#19968;&#31181;&#20840;&#38754;&#30340;&#65292;&#31995;&#32479;&#21270;&#30340;&#35299;&#20915;&#26041;&#26696;&#12290;
			&#22312;&#23433;&#20840;&#39046;&#22495;&#25105;&#20204;&#24314;&#35758;&#20320;&#37319;&#21462;&#8220;&#20998;&#23618;&#23433;&#20840;&#8221;&#65292;&#36825;&#26679;&#35753;&#27599;&#19968;&#23618;&#30830;&#20445;&#26412;&#36523;&#23613;&#21487;&#33021;&#30340;&#23433;&#20840;&#65292;&#24182;&#20026;&#20854;&#20182;&#23618;&#25552;&#20379;&#39069;&#22806;&#30340;&#23433;&#20840;&#20445;&#38556;&#12290;
			&#27599;&#23618;&#33258;&#36523;&#36234;&#26159;&#8220;&#32039;&#23494;&#8221;&#65292;&#20320;&#30340;&#31243;&#24207;&#23601;&#20250;&#36234;&#40065;&#26834;&#36234;&#23433;&#20840;&#12290;
			&#22312;&#24213;&#23618;&#65292;&#20320;&#38656;&#35201;&#22788;&#29702;&#20256;&#36755;&#23433;&#20840;&#21644;&#31995;&#32479;&#35748;&#35777;&#65292;&#20943;&#23569;&#8220;&#20013;&#38388;&#20154;&#25915;&#20987;&#8221;&#65288;man-in-the-middle
			attacks&#65289;&#12290;
			&#25509;&#19979;&#26469;&#65292;&#25105;&#20204;&#36890;&#24120;&#20250;&#20351;&#29992;&#38450;&#28779;&#22681;&#65292;&#32467;&#21512;VPN&#25110;IP&#23433;&#20840;&#26469;&#30830;&#20445;&#21482;&#26377;&#33719;&#24471;&#25480;&#26435;&#30340;&#31995;&#32479;&#25165;&#33021;&#23581;&#35797;&#36830;&#25509;&#12290;
			&#22312;&#20225;&#19994;&#29615;&#22659;&#20013;&#65292;&#20320;&#21487;&#33021;&#20250;&#37096;&#32626;&#19968;&#20010;DMZ&#65288;demilitarized
			zone&#65292;&#38548;&#31163;&#21306;&#65289;&#65292;&#23558;&#38754;&#21521;&#20844;&#20247;&#30340;&#26381;&#21153;&#22120;&#19982;&#21518;&#31471;&#25968;&#25454;&#24211;&#65292;&#24212;&#29992;&#26381;&#21153;&#22120;&#38548;&#31163;&#24320;&#12290;
			&#22312;&#20197;&#38750;&#25480;&#26435;&#29992;&#25143;&#36816;&#34892;&#36827;&#31243;&#21644;&#25991;&#20214;&#31995;&#32479;&#23433;&#20840;&#26368;&#22823;&#21270;&#19978;&#65292;&#20320;&#30340;&#25805;&#20316;&#31995;&#32479;&#20063;&#23558;&#25198;&#28436;&#19968;&#20010;&#20851;&#38190;&#30340;&#35282;&#33394;&#12290;
			&#25805;&#20316;&#31995;&#32479;&#36890;&#24120;&#37197;&#32622;&#20102;&#33258;&#24049;&#30340;&#38450;&#28779;&#22681;&#12290;
			&#28982;&#21518;&#20320;&#35201;&#38450;&#27490;&#38024;&#23545;&#31995;&#32479;&#30340;&#25298;&#32477;&#26381;&#21153;&#21644;&#26292;&#21147;&#25915;&#20987;&#12290;
			&#20837;&#20405;&#26816;&#27979;&#31995;&#32479;&#22312;&#26816;&#27979;&#21644;&#24212;&#23545;&#25915;&#20987;&#30340;&#26102;&#20505;&#23588;&#20854;&#26377;&#29992;&#12290;&#36825;&#20123;&#31995;&#32479;&#21487;&#20197;&#23454;&#26102;&#23631;&#34109;&#24694;&#24847;TCP/IP&#22320;&#22336;&#12290;
			&#22312;&#26356;&#39640;&#23618;&#19978;&#65292;&#20320;&#38656;&#35201;&#37197;&#32622;Java&#34394;&#25311;&#26426;&#65292;&#23558;&#25480;&#20104;&#19981;&#21516;java&#31867;&#22411;&#26435;&#38480;&#26368;&#23567;&#21270;&#65292;&#28982;&#21518;&#65292;&#20320;&#30340;&#24212;&#29992;&#31243;&#24207;&#35201;&#28155;&#21152;&#38024;&#23545;&#33258;&#36523;&#29305;&#23450;&#38382;&#39064;&#22495;&#30340;&#23433;&#20840;&#37197;&#12290;Spring
			Security&#20351;&#21518;&#32773; -
			&#24212;&#29992;&#31243;&#24207;&#23433;&#20840;&#21464;&#24471;&#26356;&#23481;&#26131;&#12290;</p>

		<p>&#24403;&#28982;&#65292;&#20320;&#38656;&#35201;&#22949;&#21892;&#22788;&#29702;&#19978;&#38754;&#25552;&#21040;&#30340;&#27599;&#20010;&#23433;&#20840;&#23618;&#65292;&#20197;&#21450;&#21253;&#21547;&#20110;&#27599;&#20010;&#23618;&#30340;&#31649;&#29702;&#22240;&#32032;&#12290;
			&#36825;&#20123;&#31649;&#29702;&#22240;&#32032;&#20855;&#20307;&#21253;&#25324;&#65306;&#23433;&#20840;&#20844;&#21578;&#26816;&#27979;&#65292;&#34917;&#19969;&#65292;&#20154;&#24037;&#35786;&#26029;&#65292;&#23457;&#35745;&#65292;&#21464;&#26356;&#31649;&#29702;&#65292;&#24037;&#31243;&#31649;&#29702;&#31995;&#32479;&#65292;&#25968;&#25454;&#22791;&#20221;&#65292;&#28798;&#38590;&#22238;&#22797;&#65292;&#24615;&#33021;&#35780;&#27979;&#65292;&#36127;&#36733;&#26816;&#27979;&#65292;&#38598;&#20013;&#26085;&#24535;&#65292;&#24212;&#24613;&#21453;&#24212;&#31243;&#24207;&#31561;&#31561;&#12290;</p>

		<p>Spring
			Security&#20851;&#27880;&#30340;&#37325;&#28857;&#26159;&#22312;&#20225;&#19994;&#24212;&#29992;&#23433;&#20840;&#23618;&#20026;&#24744;&#25552;&#20379;&#26381;&#21153;&#65292;&#20320;&#23558;&#21457;&#29616;&#19994;&#21153;&#38382;&#39064;&#39046;&#22495;&#23384;&#22312;&#30528;&#21508;&#24335;&#21508;&#26679;&#30340;&#38656;&#27714;&#12290;&#38134;&#34892;&#31995;&#32479;&#36319;&#30005;&#23376;&#21830;&#21153;&#24212;&#29992;&#23601;&#26377;&#24456;&#22823;&#30340;&#19981;&#21516;&#12290;&#30005;&#23376;&#21830;&#21153;&#31995;&#32479;&#19982;&#20225;&#19994;&#38144;&#21806;&#33258;&#21160;&#21270;&#24037;&#20855;&#21448;&#26377;&#24456;&#22823;&#19981;&#21516;&#12290;&#36825;&#20123;&#23458;&#25143;&#21270;&#38656;&#27714;&#35753;&#24212;&#29992;&#23433;&#20840;&#26174;&#24471;&#26377;&#36259;&#65292;&#23500;&#26377;&#25361;&#25112;&#24615;&#32780;&#19988;&#29289;&#26377;&#25152;&#20540;&#12290;</p>

		<p>
			&#35831;&#38405;&#35835;<a href="views/dataPages/getting-started.html"
				tppabs="http://www.family168.com/tutorial/springsecurity/html/getting-started.html"
				title="Part&nbsp;I.&nbsp;&#20837;&#38376;">Part&nbsp;I,
				&#8220;&#20837;&#38376;&#8221;</a>&#37096;&#20998;&#65292;&#20197;&#23427;&#20316;&#20026;&#24320;&#22987;&#12290;&#23427;&#21521;&#20320;&#20171;&#32461;&#20102;&#25972;&#20010;&#26694;&#26550;&#21644;&#20197;&#21629;&#21517;&#31354;&#38388;&#20026;&#22522;&#30784;&#31995;&#32479;&#37197;&#32622;&#26041;&#24335;&#65292;&#35753;&#20320;&#21487;&#20197;&#24456;&#24555;&#21551;&#21160;&#24182;&#36816;&#34892;&#31995;&#32479;&#12290;&#35201;&#26159;&#24819;&#26356;&#22810;&#30340;&#20102;&#35299;Spring
			Security&#26159;&#22914;&#20309;&#24037;&#20316;&#21644;&#19968;&#20123;&#20320;&#21487;&#33021;&#38656;&#35201;&#29992;&#21040;&#30340;&#31867;&#65292;&#20320;&#24212;&#35813;&#38405;&#35835;<a
				href="views/dataPages/overall-architecture.html"
				tppabs="http://www.family168.com/tutorial/springsecurity/html/overall-architecture.html"
				title="Part&nbsp;II.&nbsp;&#24635;&#20307;&#32467;&#26500;">Part&nbsp;II,
				&#8220;&#24635;&#20307;&#32467;&#26500;&#8221;</a>&#37096;&#20998;&#12290;&#26412;&#25351;&#21335;&#30340;&#20854;&#20313;&#37096;&#20998;&#20351;&#29992;&#20102;&#36739;&#20256;&#32479;&#30340;&#21442;&#32771;&#25991;&#26723;&#26041;&#24335;&#65292;&#35831;&#25353;&#29031;&#33258;&#24049;&#30340;&#38656;&#35201;&#36873;&#25321;&#38405;&#35835;&#30340;&#37096;&#20998;&#12290;
			&#25105;&#20204;&#20063;&#25512;&#33616;&#20320;&#38405;&#35835;&#23613;&#21487;&#33021;&#22810;&#30340;&#22312;&#24212;&#29992;&#23433;&#20840;&#20013;&#21487;&#33021;&#20986;&#29616;&#30340;&#19968;&#33324;&#38382;&#39064;&#12290;
			Spring
			Security&#20063;&#19981;&#26159;&#19975;&#33021;&#30340;&#65292;&#23427;&#19981;&#21487;&#33021;&#35299;&#20915;&#25152;&#26377;&#38382;&#39064;&#12290;
			&#37325;&#35201;&#30340;&#19968;&#28857;&#65292;&#24212;&#29992;&#31243;&#24207;&#24212;&#35813;&#20174;&#19968;&#24320;&#22987;&#23601;&#20026;&#23433;&#20840;&#20570;&#22909;&#35774;&#35745;&#12290;
			&#20225;&#22270;&#25913;&#36896;&#23427;&#20063;&#19981;&#26159;&#19968;&#20010;&#22909;&#20027;&#24847;&#12290;
			&#29305;&#21035;&#30340;&#65292;&#22914;&#26524;&#20320;&#22312;&#21046;&#20316;&#19968;&#20010;web&#24212;&#29992;&#65292;&#20320;&#24212;&#35813;&#30693;&#36947;&#35768;&#22810;&#28508;&#22312;&#30340;&#33030;&#24369;&#24615;&#65292;&#27604;&#22914;&#36328;&#22495;&#33050;&#26412;&#65292;&#20266;&#36896;&#35831;&#27714;&#21644;&#20250;&#35805;&#21163;&#25345;&#65292;&#36825;&#20123;&#37117;&#26159;&#20320;&#22312;&#19968;&#24320;&#22987;&#23601;&#24212;&#35813;&#32771;&#34385;&#21040;&#30340;&#12290;
			OWASP&#32593;&#31449;&#65288;http://www.owasp.org/&#65289;&#32500;&#25252;&#20102;&#19968;&#20010;web&#24212;&#29992;&#33030;&#24369;&#24615;&#21069;&#21313;&#21517;&#30340;&#21517;&#21333;&#65292;&#36824;&#26377;&#24456;&#22810;&#26377;&#29992;&#30340;&#21442;&#32771;&#20449;&#24687;&#12290;
		</p>

		<p>
			&#25105;&#20204;&#24076;&#26395;&#20320;&#35273;&#24471;&#36825;&#26159;&#19968;&#31687;&#24456;&#26377;&#29992;&#30340;&#21442;&#32771;&#25351;&#21335;&#65292;&#24182;&#27426;&#36814;&#24744;&#25552;&#20379;&#21453;&#39304;&#24847;&#35265;&#21644;<a
				href="views/dataPages/community.html#jira"
				tppabs="http://www.family168.com/tutorial/springsecurity/html/community.html#jira"
				title="4.1.&nbsp;&#20219;&#21153;&#36319;&#36394;">&#24314;&#35758;</a>&#12290;
		</p>

		<p>
			&#26368;&#21518;&#65292;&#27426;&#36814;&#21152;&#20837;Spring
			Security <a href="views/dataPages/community.html"
				tppabs="http://www.family168.com/tutorial/springsecurity/html/community.html"
				title="Chapter&nbsp;4.&nbsp;Spring Security&#31038;&#21306;">&#31038;&#21306;</a>&#12290;
		</p>
	</div>
	<div xmlns:fo="http://www.w3.org/1999/XSL/Format" class="navfooter">
		<hr>
		<table width="100%" summary="Navigation footer">
			<tr>
				<td width="40%" align="left"><a accesskey="p"
					href="views/dataPages/springsecurity.html"
					tppabs="http://www.family168.com/tutorial/springsecurity/html/springsecurity.html">Prev</a>&nbsp;</td>
				<td width="20%" align="center"><a accesskey="h"
					href="views/dataPages/springsecurity.html"
					tppabs="http://www.family168.com/tutorial/springsecurity/html/springsecurity.html">Home</a></td>
				<td width="40%" align="right">&nbsp;<a accesskey="n"
					href="views/dataPages/getting-started.html"
					tppabs="http://www.family168.com/tutorial/springsecurity/html/getting-started.html">Next</a></td>
			</tr>
			<tr>
				<td width="40%" align="left" valign="top">Spring Security&nbsp;</td>
				<td width="20%" align="center"><span
					style="color: white; font-size: 90%;"><a
						href="javascript:if(confirm('http://www.springsource.com/  \n\n该文件无法用 Teleport Ultra 下载, 因为 它是一个域或路径外部被设置为它的启始地址的地址。  \n\n你想在服务器上打开它?'))window.location='http://www.springsource.com/'"
						tppabs="http://www.springsource.com/" title="SpringSource">Sponsored
							by SpringSource </a></span></td>
				<td width="40%" align="right" valign="top">&nbsp;Part&nbsp;I.&nbsp;&#20837;&#38376;</td>
			</tr>
		</table>
	</div>
</body>
</html>